
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ДенежныеСредства Приход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движения.ДенежныеСредства.Очистить();
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Касса = Касса;
	Движение.Сумма = Сумма;
	
	// регистр Взаиморасчеты Расход
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Взаиморасчеты.Очистить();
	Для Каждого Стр Из ОбъектыРассчетов Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Партнер = Партнер;
		Движение.Сумма = Стр.Сумма;
		Движение.Объект = Стр.Объект;
		Движение.Период = Дата;
	КонецЦикла;
	Движения.Записать();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задача") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		Партнер 	= ДанныеЗаполнения.Партнер;
		Сумма 		= ДанныеЗаполнения.Сумма;
		
		Стр 		= ОбъектыРассчетов.Добавить();
		Стр.Объект 	= ДанныеЗаполнения.Ссылка;
		Стр.Сумма  	= ДанныеЗаполнения.Сумма;
	КонецЕсли;
КонецПроцедуры
