
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	ЗаполнитьЛид();
	ОбновитьСписокПредложений();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПредложений()
	СписокПредложений.Параметры.УстановитьЗначениеПараметра("Партнер",Объект.Партнер);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛид()
	Элементы.ИсточникЛида.Доступность = Истина;
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		Если ЗначениеЗаполнено(Объект.Партнер.Источник) И НЕ ЗначениеЗаполнено(Объект.ИсточникЛида) Тогда
			Объект.ИсточникЛида = Объект.Партнер.Источник;
			Элементы.ИсточникЛида.Доступность = Ложь;
		ИначеЕсли Объект.Партнер.Источник = Объект.ИсточникЛида Тогда
			Элементы.ИсточникЛида.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ЗаполнитьЛид();
	ОбновитьСписокПредложений();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьИсточникЛидаПартнера();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсточникЛидаПартнера()
	Если НЕ ЗначениеЗаполнено(Объект.Партнер.Источник) Тогда
		темпПартнер = Объект.Партнер.ПолучитьОбъект();
		темпПартнер.Источник = Объект.ИсточникЛида;
		темпПартнер.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПредложенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СправочникСсылка.Номенклатура") Тогда
		Нстр = Объект.ПредпологаемыеУслуги.Добавить();
		Нстр.Номенклатура = ВыбраннаяСтрока;
		Нстр.Цена = УстановитьЦену(ВыбраннаяСтрока);
		Нстр.Количество = 1;
		Нстр.Сумма = Нстр.Количество * Нстр.Цена;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммыСтроки()
	СтрокаТабличнойЧасти = Элементы.ПредпологаемыеУслуги.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	ПересчетСуммы();
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммы()
	Если НЕ Объект.ОриентировочнаяСумма = Объект.ПредпологаемыеУслуги.Итог("Сумма") Тогда
		Объект.ОриентировочнаяСумма = Объект.ПредпологаемыеУслуги.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредпологаемыеУслугиКоличествоПриИзменении(Элемент)
	ПересчетСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПредпологаемыеУслугиЦенаПриИзменении(Элемент)
	ПересчетСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПредпологаемыеУслугиНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = УстановитьЦену(СтрокаТабличнойЧасти.Номенклатура);
	ПересчетСуммыСтроки();
КонецПроцедуры

&НаСервере
Функция УстановитьЦену(Номенклатура)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаДок,
	|			Номенклатура = &Номенклатура
	|				И Партнер = &Партнер) КАК ЦеныНоменклатурыСрезПоследних");
	Запрос.УстановитьПараметр("Партнер",Объект.Партнер);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ДатаДок",Объект.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;
КонецФункции