
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДенегВКассе();
КонецПроцедуры

&НаСервере
Процедура ДенегВКассе()
	
	ОстатокДенегВКассеИтог = 0;
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.Касса,
	|	ДенежныеСредстваОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки КАК ДенежныеСредстваОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммаОстаток УБЫВ");
	Выборка = Запрос.Выполнить().Выбрать();
	ДеньгиТекс = "";
	Пока Выборка.Следующий() Цикл
		ДеньгиТекс = ДеньгиТекс + ?(ЗначениеЗаполнено(ДеньгиТекс), Символы.ПС, "") + Выборка.Касса + ": " + Выборка.СуммаОстаток;
		ОстатокДенегВКассеИтог = ОстатокДенегВКассеИтог + Выборка.СуммаОстаток;
	КонецЦикла;
	
	Элементы.КассаТекст.Заголовок = ДеньгиТекс;
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.Партнер,
	|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки КАК ВзаиморасчетыОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	СуммаОстаток УБЫВ");
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТекДолги   = "";
	Заработали = "";
	ОстСумма = 0;
	Итог 	 = 0;
	
	НПП = 0;
	Пока Выборка.Следующий() Цикл
		НПП = НПП + 1;
		Если НПП < 4 Тогда
			ТекДолги = ТекДолги + Строка(НПП) + "." + Выборка.Партнер + " - " + Выборка.СуммаОстаток + Символы.ПС;
		Иначе
			ОстСумма = ОстСумма + Выборка.СуммаОстаток;
		КонецЕсли;
		
		Итог = Итог + Выборка.СуммаОстаток;
	КонецЦикла;
	ТекДолги 	= ТекДолги + "Ост. - " + ОстСумма+ Символы.ПС;
	
	Элементы.ДолгиТекст.Заголовок = ТекДолги;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ДенегВКассе();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры
