
&НаКлиенте
Процедура ПодборЗадач(Команда)
	Парм = Новый Структура;
	Парм.Вставить("Партнер",Объект.Партнер);
	Парм.Вставить("Сумма",Объект.Сумма);
	ОткрытьФорму("Обработка.ПодборЗадач.Форма.Форма",Парм,,,,,Новый ОписаниеОповещения("ЗаполнитьДокументЗадачами",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументЗадачами(Результат,хзчтозапар) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		Для Каждого Стр Из Результат Цикл
			нСтр = Объект.ОбъектыРассчетов.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,Стр);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


