
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Контакт") Тогда
		Важная = ДанныеЗаполнения.Важный;
		Контакт = ДанныеЗаполнения.Ссылка;
		Партнер = ДанныеЗаполнения.Партнер;
		
		Для Каждого Стр Из ДанныеЗаполнения.ПредпологаемыеУслуги Цикл
			Нстр = Работы.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,Стр); 
		КонецЦикла;
		Сумма = Работы.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Взаиморасчеты.Очистить();
	Если Статус = Перечисления.СтатусыЗадач.Закрыта Тогда 
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Партнер = Партнер;
		Движение.Объект = Ссылка;
		Движение.Сумма = Сумма;
	КонецЕсли;
	Движения.Записать();
КонецПроцедуры
